Tekla.Structures.Drawing.IncludeRevisionMarkEnum
Options for including a revision info in file name

Tekla.Structures.Drawing.IncludeRevisionMarkEnum.Never
Never include revision info

Tekla.Structures.Drawing.IncludeRevisionMarkEnum.Always
Always include revision info

Tekla.Structures.Drawing.IncludeRevisionMarkEnum.ByFormatString
Include revision info if it's present in the format string, otherwise not